In [2]:
import pandas as pd
emp = {"Name": ["parker","smith","william","parker"], "Age":[21,32,29,21], "Roll":[101,104,105,101]}
info = pd.DataFrame(emp)
print(info)

      Name  Age  Roll
0   parker   21   101
1    smith   32   104
2  william   29   105
3   parker   21   101

In [23]:
#import numpy as np
one = pd.array{"Numbers:" [1,2,3,4,5]}
two = pd.DataFrame(one)
print(two)

SyntaxError: invalid syntax (3015730449.py, line 2)

In [4]:
info.drop_duplicates()

      Name  Age  Roll
0   parker   21   101
1    smith   32   104
2  william   29   105

In [5]:
info.drop_duplicates(keep='last')

      Name  Age  Roll
1    smith   32   104
2  william   29   105
3   parker   21   101

In [6]:
info.drop_duplicates(keep=False)

      Name  Age  Roll
1    smith   32   104
2  william   29   105

In [7]:
ag=info['Age']
ag

0    21
1    32
2    29
3    21
Name: Age, dtype: int64

In [8]:
ag.mean()

25.75

In [9]:
info.sort_values(['Age'])

      Name  Age  Roll
0   parker   21   101
3   parker   21   101
2  william   29   105
1    smith   32   104

In [10]:
info.sort_values(['Age'], ascending=False)

      Name  Age  Roll
1    smith   32   104
2  william   29   105
0   parker   21   101
3   parker   21   101

In [11]:
users = pd.DataFrame({"Name": ["Taylor", "Alex", "Shannon", "Tracy"], "Siblings": [2,3,0,1]})
users

      Name  Siblings
0   Taylor         2
1     Alex         3
2  Shannon         0
3    Tracy         1

In [12]:
color = pd.DataFrame({"Name": ["Taylor", "Alex", "Morgan"], "Eye Color": ["Blue", "Brown", "Brown"]})
color

     Name Eye Color
0  Taylor      Blue
1    Alex     Brown
2  Morgan     Brown

In [13]:
pd.concat([users, color])

      Name  Siblings Eye Color
0   Taylor       2.0       NaN
1     Alex       3.0       NaN
2  Shannon       0.0       NaN
3    Tracy       1.0       NaN
0   Taylor       NaN      Blue
1     Alex       NaN     Brown
2   Morgan       NaN     Brown

In [14]:
pd.concat([users, color], ignore_index = True) #ignores the indices of the previous datasets and creates a new one.

      Name  Siblings Eye Color
0   Taylor       2.0       NaN
1     Alex       3.0       NaN
2  Shannon       0.0       NaN
3    Tracy       1.0       NaN
4   Taylor       NaN      Blue
5     Alex       NaN     Brown
6   Morgan       NaN     Brown

In [15]:
pd.concat([users, color], axis = 1) #axis = 0 adds the new set vertically. axis = 1 adds the new dataset horizontally.

      Name  Siblings    Name Eye Color
0   Taylor         2  Taylor      Blue
1     Alex         3    Alex     Brown
2  Shannon         0  Morgan     Brown
3    Tracy         1     NaN       NaN

In [16]:
users.merge(color, on = "Name") #merges the two datasets by considering the intersection data.
#how = "inner" -> Intersection
#how = "outer" -> Union
#how = "left" -> Set A
#how = "right" -> Set B

     Name  Siblings Eye Color
0  Taylor         2      Blue
1    Alex         3     Brown

In [17]:
users.merge(color, on = "Name", how = "outer")

      Name  Siblings Eye Color
0     Alex       3.0     Brown
1   Morgan       NaN     Brown
2  Shannon       0.0       NaN
3   Taylor       2.0      Blue
4    Tracy       1.0       NaN

In [18]:
users.merge(color, on = "Name", how = "left")

      Name  Siblings Eye Color
0   Taylor         2      Blue
1     Alex         3     Brown
2  Shannon         0       NaN
3    Tracy         1       NaN

In [26]:
import pandas as pd
import numpy as np

data = {'First Score': [100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score': [np.nan, 40, 80, 98]}
df = pd.DataFrame(data)

# Check for null values
df.isnull()  # Returns a DataFrame of Boolean values

   First Score  Second Score  Third Score
0        False         False         True
1        False         False        False
2         True         False        False
3        False          True        False